app/controllers/chat_rooms_controller.rb

def index
    @chat_rooms ||= ChatRoom.all
    @profile=User.all
---
SELECT "chat_rooms".* FROM "chat_rooms"
SELECT "users".* FROM "users"

  def create
    @chat_room = current_user.chat_rooms.build(chat_room_params)
    if @chat_room.save
---
INSERT INTO "chat_rooms" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "abcd"], ["user_id", 1], ["created_at", "2017-06-21 10:25:03.026656"], ["updated_at", "2017-06-21 10:25:03.026656"]]

  def show
    @chat_room ||= ChatRoom.includes(:messages).find_by(id: params[:id])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = 1

  def delete
    @chat1 = ChatRoom.find(params[:format]).messages
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]