app/controllers/chat_manage_controller.rb

	def show
		@chat = ChatRoom.all
---
SELECT "chat_rooms".* FROM "chat_rooms"

	def edit
		@chat = ChatRoom.find(params[:format])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

	def update
		byebug
		@chat = ChatRoom.find(params[:format])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

	def delete
		@chat = ChatRoom.find(params[:format])
		@chat.destroy
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "chat_rooms" WHERE "chat_rooms"."id" = ?  [["id", 1]]

	def profile
		@user = User.find(params[:format])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]