app/controllers/emails_controller.rb

  def index
    @emails ||= Email.all
---
SELECT "emails".* FROM "emails"

  def create
    @email ||= Email.new(email_params)

    respond_to do |format|
      if @email.save
---
INSERT INTO "emails" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dfbdf"], ["email", "velusamyvnp@gmail.com"], ["created_at", "2017-06-26 07:21:07.357710"], ["updated_at", "2017-06-26 07:21:07.357710"]]

  def destroy
    @email.destroy
---
DELETE FROM "emails" WHERE "emails"."id" = ?  [["id", 1]]

    def set_email
      @email ||= Email.find(params[:id])
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]